snlkuharlocal/src/Documents/ЗапросКодовМаркировки/ЗапросКодовМаркировки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗапросКодовМаркировки</name>
  <basedOn>Catalog.Номенклатура</basedOn>
  <basedOn>Document.ПриходнаяНакладная</basedOn>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыДокументовМаркировки</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ПриходнаяНакладная</types>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстОшибки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ГТИН</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>14</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

snlkuharlocal/src/InformationRegisters/ЗапросыЧЗ/ЗапросыЧЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЗапросыЧЗ</name>
  <resources>
    <name>КодОтветаHTTP</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Успешно</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>Сервер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДанныеЗапроса</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ДанныеОтвета</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Вид</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>5</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ХранилищеКодовМаркировки</types>
      <types>DocumentRef.ЗаказНаЭмиссиюКодовМаркировкиСУЗ</types>
      <types>DocumentRef.ЛистПереукладки</types>
      <types>DocumentRef.ЗаявкаНаПередачуКарточекНоменклатурыВЧЗ</types>
      <types>DocumentRef.ЗапросКодовМаркировки</types>
      <types>DocumentRef.ЛистСборкиКомплектовЧЗ</types>
      <types>CatalogRef.Номенклатура</types>
      <types>DocumentRef.ЛистНабора</types>
      <types>DocumentRef.МаркировкаТоваровИСМП</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяВыполнения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресРесурса</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПараметрыURL</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <dimensions>
    <name>ИД</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

snlkuharlocal/src/Enums/СтатусыДокументовМаркировки/СтатусыДокументовМаркировки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыДокументовМаркировки</name>
  <enumValues>
    <name>ВРаботе</name>
  </enumValues>
  <enumValues>
    <name>ОжиданиеОтложеннойОбработки</name>
  </enumValues>
  <enumValues>
    <name>КОбработке</name>
  </enumValues>
  <enumValues>
    <name>Обрабатывается</name>
  </enumValues>
  <enumValues>
    <name>ОшибкаОбработки</name>
  </enumValues>
  <enumValues>
    <name>ОбработанЧЗ</name>
  </enumValues>
  <enumValues>
    <name>ОшибкаОбработкиЧЗ</name>
  </enumValues>
  <enumValues>
    <name>Обработан</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Documents/ЗапросКодовМаркировки/ManagerModule.bsl
Функция ПроверитьДокументПередОтправкойВЧЗ(ДокСсылка) Экспорт
	Результат = МаркировкаКС.СтруктураРезультата(Ложь);
	
	Реквизиты = ПолучитьРеквизитыШапки(ДокСсылка, "Проведен,Статус");
	Если Реквизиты.Проведен Тогда		
		Если Реквизиты.Статус = Перечисления.СтатусыДокументовМаркировки.ВРаботе
			ИЛИ Реквизиты.Статус = Перечисления.СтатусыДокументовМаркировки.КОбработке Тогда
			Результат = ПроверитьТоварНаПустыеГТИНиДубли(ДокСсылка);
		Иначе			
			ТекстОшибки = СтрШаблон("Не допустимый статус док-та: %1, статус: '%2', должен быть: 'В работе' или 'К обработке'.", ДокСсылка, Реквизиты.Статус);
			Результат.Ошибки.Добавить(ТекстОшибки);
		КонецЕсли;
	Иначе
		ТекстОшибки = СтрШаблон("Документ  '%1' не проведен.", ДокСсылка);
		Результат.Ошибки.Добавить(ТекстОшибки);
	КонецЕсли;
	
	Возврат Результат;
КонецФункции //ПроверитьДокументПередОтправкойВЧЗ()

Функция ПроверитьТоварНаПустыеГТИНиДубли(ДокСсылка)
	Результат	= МаркировкаКС.СтруктураРезультата();	
	Запрос		= Новый ("Запрос");
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	КОЛИЧЕСТВО(*) КАК КолСтрок
	|ИЗ
	|	Документ.ЗапросКодовМаркировки.Товары КАК ТЧ_Товары
	|ГДЕ	
	|	ТЧ_Товары.Ссылка = &ДокСсылка
	|;
	|ВЫБРАТЬ
	|	ТЧ_Товары.Номенклатура 			КАК Номенклатура,	
	|	ТЧ_Товары.Номенклатура.Код	 	КАК Номенклатура_Код,
	|	ТЧ_Товары.Номенклатура.ГТИН 	КАК Номенклатура_ГТИН,
	|
	|	ТЧ_Товары_Дубли.Ссылка			КАК Заявка_Дубль
	|ИЗ
	|	Документ.ЗапросКодовМаркировки.Товары КАК ТЧ_Товары
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	Документ.ЗапросКодовМаркировки.Товары КАК ТЧ_Товары_Дубли
	|ПО
	|	ТЧ_Товары.Номенклатура = ТЧ_Товары_Дубли.Номенклатура
	|	И ТЧ_Товары.Ссылка <> ТЧ_Товары_Дубли.Ссылка
	|ГДЕ	
	|	ТЧ_Товары.Ссылка = &ДокСсылка
	|	И (
	|		ТЧ_Товары.Номенклатура.ГТИН <> """"	
	|		ИЛИ НЕ ТЧ_Товары_Дубли.Номенклатура ЕСТЬ NULL
	|	)	
	|;
	|ВЫБРАТЬ
	|	Номенклатура,
	|	Номенклатура.Код КАК Номенклатура_Код,
	|	КОЛИЧЕСТВО(*)	 КАК КолСтрок
	|ИЗ
	|	Документ.ЗапросКодовМаркировки.Товары КАК ТЧ_Товары
	|ГДЕ	
	|	ТЧ_Товары.Ссылка = &ДокСсылка	
	|СГРУППИРОВАТЬ ПО
	|	Номенклатура
	|ИМЕЮЩИЕ
	|	КОЛИЧЕСТВО(*)>1
	|";
	
	Запрос.УстановитьПараметр("ДокСсылка", ДокСсылка);
	
	рЗапроса = Запрос.ВыполнитьПакет();
	
	Выборка = рЗапроса[рЗапроса.ВГраница() - 2].Выбрать();
	Если Выборка.Следующий() И ЗначениеЗаполнено(Выборка.КолСтрок) Тогда
		Выборка = рЗапроса[рЗапроса.ВГраница() - 1].Выбрать();
		Пока Выборка.Следующий() Цикл
			Если ЗначениеЗаполнено(Выборка.Номенклатура_ГТИН) Тогда
				Результат.Ошибки.Добавить(СтрШаблон("У номенклатуры: '%1' (%3) уже установлен GTIN: '%3' !",
					Выборка.Номенклатура, Выборка.Номенклатура_Код, Выборка.Номенклатура_ГТИН));			
			КонецЕсли;
			Если ЗначениеЗаполнено(Выборка.Заявка_Дубль) Тогда
				Результат.Ошибки.Добавить(СтрШаблон("По номенклатуре: '%1' (%3) уже создана заявка на GTIN: '%3' !",
					Выборка.Номенклатура, Выборка.Номенклатура_Код, Выборка.Заявка_Дубль));		
			КонецЕсли;
		КонецЦикла;		
		
		Выборка = рЗапроса[рЗапроса.ВГраница()].Выбрать();
		Пока Выборка.Следующий() Цикл
			Результат.Ошибки.Добавить(СтрШаблон("Номенклатура: '%1' (%3) присутствует в документе %3 раза !",
				Выборка.Номенклатура, Выборка.Номенклатура_Код, Выборка.КолСтрок));
		КонецЦикла;
	Иначе		
		Результат.Ошибки.Добавить("Не выбрано ни одной позиции номенклатуры ! ");			
	КонецЕсли;	
	
	Результат.Успешно = (Результат.Ошибки.Количество() = 0);
	
	Возврат Результат;
КонецФункции //ПроверитьТоварНаПустыеГТИН(ДокСсылка)

Функция ЗагрузитьГТИНизЛогов(ДокСсылка) Экспорт	
	Результат = МаркировкаКС.СтруктураРезультата();
	
	рЧтения = ПрочитатьГТИНизЛогов(ДокСсылка);
	ПрочитаноКодов = рЧтения.Данные.Количество();
	Если ПрочитаноКодов > 0 Тогда
		ДокОбъект = ДокСсылка.ПолучитьОбъект();	
		Если 1 = 2 Тогда
			ДокОбъект = Документы.ЗапросКодовМаркировки.СоздатьДокумент();		
		КонецЕсли; 
		
		ТЧ_Товары = ДокОбъект.Товары;
		Если ТЧ_Товары.Количество() = ПрочитаноКодов Тогда
			Сч	= 0;
			Для Каждого НовГТИН Из рЧтения.Данные Цикл
				ТекГТИН = ТЧ_Товары[Сч].ГТИН;				
				Если ПустаяСтрока(ТекГТИН) Тогда				
					ТЧ_Товары[Сч].ГТИН = Прав("00000000000000" + СокрЛП(НовГТИН), 14);
				Иначе
					Если ТекГТИН <> НовГТИН Тогда
						Результат.Ошибки.Добавить("В строке %1 обнаружен другой GTIN ! GTIN в строке '%2', GTIN в логах '%3' !", Сч + 1, ТекГТИН, НовГТИН);						
					КонецЕсли;					
				КонецЕсли;				
				Сч = Сч+1;
			КонецЦикла; 
			
			Попытка
			    ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);			
			Исключение
				Результат.Ошибки.Добавить("Не обнаружено кодов GTIN в логах запросов ЧЗ !");
			КонецПопытки;			
		Иначе
			ТекстСообщения = СтрШаблон("Не совпадает количество кодов ! Запрошено: %1, получено: %2 !", ТЧ_Товары.Количество(), ПрочитаноКодов);
			Результат.Ошибки.Добавить(ТекстСообщения);
		КонецЕсли; 
	Иначе
		Результат.Ошибки.Добавить("Не обнаружено кодов GTIN в логах запросов ЧЗ !"); 
	КонецЕсли;
	
	Результат.Успешно = (Результат.Ошибки.Количество() = 0);
	
	Возврат Результат;
КонецФункции //ЗагрузитьГТИНизЛогов(ДокСсылка) Экспорт

Функция ПрочитатьГТИНизЛогов(ДокОснование) Экспорт
	Результат = МаркировкаКС.СтруктураРезультата();
	
	тРезультат = Новый ТаблицаЗначений;
	тРезультат.Колонки.Добавить("ГТИН");
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ИД	
	|ИЗ
	|	РегистрСведений.ЗапросыЧЗ КАК ЗапросыЧЗ	
	|ГДЕ
	|	КодОтветаHTTP	= 200
	|	И АдресРесурса	= ""v3/generate-gtins""
	|	И Основание		= &ДокОснование	
	|УПОРЯДОЧИТЬ ПО
	|	ДатаНачала
	|";
	
	Запрос.УстановитьПараметр("ДокОснование", ДокОснование);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		МЗ 		= РегистрыСведений.ЗапросыЧЗ.СоздатьМенеджерЗаписи();
		МЗ.ИД 	= Выборка.ИД;
		
		МЗ.Прочитать();
		Если ЗначениеЗаполнено(МЗ.ИД) И МЗ.ИД = Выборка.ИД Тогда
			СтрокаОтвета = МЗ.ДанныеОтвета.Получить();		
			Если НЕ ПустаяСтрока(СтрокаОтвета) Тогда
				Попытка
				    Данные 	= МаркировкаКС.ПрочитатьЖСОН(СтрокаОтвета, Истина);
					
					result	= МаркировкаКС.ПолучитьЗначениеПараметра(Данные, "result");
					error	= МаркировкаКС.ПолучитьЗначениеПараметра(result, "error");
					
					Если ЗначениеЗаполнено(error) Тогда
						Результат.Ошибки.Добавить(error);						
					Иначе						
						ДанныеГТИН = МаркировкаКС.ПолучитьЗначениеПараметра(result, "drafts");
						Если ТипЗнч(ДанныеГТИН) = Тип("Массив") Тогда
							Для Каждого Элемент Из ДанныеГТИН Цикл
								ГТИН = Элемент["gtin"];								
								Если ЗначениеЗаполнено(ГТИН) Тогда								
									СтрокаД 		= тРезультат.Добавить();
									СтрокаД.ГТИН	= ГТИН;
								КонецЕсли;							
							КонецЦикла; 						
						КонецЕсли;
					КонецЕсли;
				Исключение					
				КонецПопытки;
			КонецЕсли; 
		КонецЕсли;
	КонецЦикла;
	
	тРезультат.Свернуть("ГТИН",);
	тРезультат.Сортировать("ГТИН");
	
	Результат.Данные = тРезультат.ВыгрузитьКолонку("ГТИН");
	
	Возврат Результат;
КонецФункции //ПрочитатьГТИНизЛогов(ДокОснование) Экспорт
